## **[MySQL SELECT statement without the FROM clause](https://www.mysqltutorial.org/mysql-basics/mysql-select/)**

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Use the MySQL SELECT statement without referencing any table.

In [3]:
pd.read_sql('SELECT 1 + 1', engine)

   1 + 1
0      2

In [4]:
df1 = pd.DataFrame.from_dict({1: [1]})
df2 = pd.DataFrame.from_dict({1: [1]})

df = df1 + df2
df.rename(columns={1: '1 + 1'})

   1 + 1
0      2

In [5]:
pd.read_sql('SELECT NOW();', engine)

                NOW()
0 2023-03-22 11:07:30

In [6]:
pd.DataFrame.from_dict({'NOW()': [pd.to_datetime('today')]})

                       NOW()
0 2023-03-22 11:07:30.710084

In [7]:
pd.read_sql("SELECT CONCAT('John', ' ', 'Doe')", engine)

  CONCAT('John', ' ', 'Doe')
0                   John Doe

In [8]:
pd.DataFrame.from_dict({"CONCAT('John',' ','Doe')": [' '.join(['John', 'Doe'])]})

  CONCAT('John',' ','Doe')
0                 John Doe

### The dual table

syntax:

SELECT select_list
FROM dual;

### A quick introduction to the column alias

syntax:

SELECT expression AS column_alias;
SELECT expression column_alias;

In [9]:
string = '''
SELECT concat('John', ' ', 'Doe') as name;
'''

pd.read_sql(string, engine)

       name
0  John Doe

In [10]:
pd.DataFrame({'name': [' '.join(['John', 'Doe'])]})

       name
0  John Doe

In [11]:
string = '''
SELECT concat('John', ' ', 'Doe') as 'Full Name';
'''

pd.read_sql(string, engine)

  Full Name
0  John Doe

In [12]:
pd.DataFrame({
    'Full Name': [' '.join(['John', 'Doe'])]})

  Full Name
0  John Doe